{
	"bio": "Hello there. I'm Mike MacCana, an engineer, designer, writer, and speaker, living and working in London.",
	"articles": [
		{
			"title":"Content creation apps finally get out of the way",
			"publication_date":"2012-02-17",
			"body":"<p>When Microsoft Office 4.3 debuted in 1994, the app had what would become a very well known user interface. a row of icons, originally in colors to match the 20 'reserved' Windows colors along the top of the screen <sup><a href='#windows_colors'>&dagger;</a></sup>. The save button was Windows 'dark blue'. The 'new document' icon was yellow and dark yellow. These icons lasted 9 years without significant change - with Office 97 removed the borders around each icon for a cleaner look - but otherwise everything remained intact, till Office 2003. </p><p>In 2002 Microsoft had two rivals: the biggest was themselves: since Office 97 they'd saturated the market and selling new version of apps that customers already owned was difficult. Additionally StarOffice, an obscure suite that had been around for a while, was purchased by one of Microsoft's main rivals. The suite, now called OpenOffice, was now given away for free, backed by a large company, and looked exactly like Microsoft Office. Suddenly the also-ran was a potential competitor. </p><p>Office 2003 began departing from the Office look of the last decade. Computers capabilities had changed, so Office 2003 took advantage of all those new colors. Blue gradients were everywhere. The floppy disk 'save' icon became a strange silky soft blue thing that, if you're old enough to remember floppy disks, you may have trouble recalling. The magnifying glass has a wooden handle, the printer looked like a tiny picture of a printer complete with a tiny little green light on it to show you it was printing. Office 2003 looked immediately distinct from both previous versions of Microsoft Office and OpenOffice. </p><p>Office 2007 continued the trend: adding a layer of blue gloss, icons in the top of the Window, a large multicolor Office logo, yellow/orange highlights for selected icons, a large purple 'Change Styles' button, and another layer of gloss and a gradient for the document background. There's a new UI feature here too: tabbed toolbars and multi-row groups of icons. There's dividers between each icon group, and a darkened area at the bottom of each group showing the group's name. </p><q>Office 2007 seems to have forgotten its purpose: actually making documents.</q><p>Oh dear. Office 2007 was unpopular for other reasons - users didn't like the tabbed toolbars - but there's something else going on here: Office 2007 seems to have forgotten its purpose: actually making documents. The user interface has started to become worthy of attention in itself. </p><p>Office 2010 reigned in the Office 2007 design. There's no gloss on the icons. The large, shiny multicolor Office logo is now smaller, flat, and two colors. The gradient and gloss behind the document is replaced with a simple drop shadow. The icons on the topedge of the window exist, but the 3D effects have been removed. Two vertical lines between each icon group are replaced by a single line. The dark background for the icon group name is gone - it turns out that text is enough. </p><p>Office 2010 is a mature and subtle iteration of the Office 2007 design. It shifts the focus away from the toolbar and back to the document. </p><p>And so we arrive at Office 2015: and the first thing you'll notice is: the document. Type, save and undo things (two of the few icons displayed by default). The functionality is still there if you want them, but the focus is on your content.</p><q>Using an app to make something isn't about the app, it's about <strong>making something</strong>.</q><p>After nearly two decades, the lesson has been learnt: using an app to make something isn't about the app, it's about making something. Other professional creation creations tools have understood this for years: script writers have Final Draft, programmers have Vim - these tools have UIs that are either minimal or hidden completely until the user needs them. </p><p>It started a few years ago with Flipboard: an iPad social networking app which has very little UI at all, using intuitive gestures rather than explicit on-screen navigation. Around the same time, nearly all web browsers removed the multitude of toolbar buttons they'd been accumulating, leaving just the back, forward and reload buttons. But now there's an industry-wide shift towards content, away from 'featured' user interfaces: Google Docs and GMail have also ditched ditched color icons, and Microsoft's Visual Studio has gotten rid of them too. After using all the UI richness and color available for such a long time to make beautiful and differentiated products, app designers have realized that the user's work, not their own, is the star of the show. </p><aside><a name='windows_colors'>&dagger; Windows supported more colors than this at the time, but only 20 were guaranteed to remain consistent.</a></aside>",
			"footer":"&mdash; I hope you've enjoyed this piece. If you'd like to keep in contact, follow me on Twitter or see the contact page for more options."
		}
	]
}
