{
	"bio": "Hello there. I'm Mike MacCana, an engineer, designer, writer, and speaker, living and working in London.",
	"articles": [
		{
			"title":"Content creation apps finally get out of the way",
			"publication_date":"2012-03-01",
			"body":"<p>When Microsoft Office 4.3 debuted in 1994, the app had what would become a very well known user interface. A row of icons, originally in colors to match the 20 'reserved' Windows colors along the top of the screen <sup><a href='#windows_colors'>&dagger;</a></sup>. The save button was Windows 'dark blue', the new document icon was 'yellow' and 'dark yellow'. These icons lasted 9 years without significant change - Office 97 removed the borders around each icon for a cleaner look, but otherwise everything remained intact. </p><figure><img src='/images/blog/office94.jpg'><figcaption>Office 4.3 - Windows reserved colors only</figcaption></figure><p>By 2002 Microsoft had two rivals. The biggest, by far, was themselves: since Office 97 they'd saturated the market and selling new versions of apps that customers already owned was difficult. Additionally StarOffice, an obscure suite that had been around for a while, was purchased by one of Microsoft's competitors. The suite, renamed OpenOffice, was now given away for free, backed by a large company, and looked exactly like Microsoft Office. The solution to both was something that appeared immediately different: </p><figure><img src='/images/blog/office_2003.png'><figcaption>Office 2003 - gradients everywhere, almost every icon has had some color added.</figcaption></figure><p>Office 2003 began departing from the Office look of the last decade, taking advantage of all those new colors modern-day computers provided. Blue gradients were everywhere. The floppy disk 'save' icon became a strange silky soft thing that, if you're old enough to remember floppy disks, you may have trouble recalling. The magnifying glass has a wooden handle, the printer looked like a tiny picture of a printer complete with a little green light on it to show you it was printing. Office 2003 looked immediately distinct from both previous versions of Microsoft Office and OpenOffice. </p><p>Office 2007 continued the trend:<p><figure><img src='/images/blog/word_2007.png'><figcaption>Office 2007 - more gradients, plus new gloss.</figcaption></figure></p><p>The new suite added a layer of blue gloss, icons in the top edge of the window, a large multicolor Office logo, orange highlighting for selected icons, large colored icons for 'important' functionality, and another gradient / layer of gloss for the document background. There's a new UI feature here too: tabbed toolbars and multi-row groups of icons. There's dividers between each icon group, and a darkened area at the bottom of each group showing the group's name. </p><q>Office 2007 seems to have forgotten its purpose: actually making documents.</q><p>Oh dear. Office 2007 was unpopular for other reasons - users didn't like the tabbed toolbars - but there's something else going on here: Office 2007 seems to have forgotten its purpose: actually making documents. The user interface has started to become worthy of attention in itself. </p><p>Microsoft seem to have noticed this: Office 2010 reigned in the Office 2007 design:</p><figure><img src='/images/blog/word_2010.png'><figcaption>Office 2010 - a mature iteration that removes a significant amount of UI chrome.</figcaption></figure><p>There's no gloss on the icons. The large, shiny multicolor Office logo is now smaller, flat, and two colors. The gradient and gloss behind the document is replaced with a simple drop shadow. The icons on the topedge of the window exist, but the 3D effects have been removed. Two vertical lines between each icon group are replaced by a single line. The dark background for the icon group name is gone - it turns out that text is enough. </p><p>Office 2010 is a mature and subtle iteration of the Office 2007 design. It shifts the focus away from the toolbar and back to the document. </p><p>And so we arrive at Office 15: </p><figure><img src='/images/blog/word_15.png'><figcaption>Office 15 - document centric UI</figcaption></figure></p>The first thing you'll notice is the document itself. The obvious thing to do: start typing. Secondary to that, you can save and undo things - two of the few icons displayed by default. All the other functionality for the last two decades is still there, but the focus is on your content, not whether to make some of your text bold. Possible future things you might want to do with your document, beyond changing it's text, don't take up room that could be used to show more of the document. </p><q>Using an app to make something isn't about the app, it's about <strong>making something</strong>.</q><p>After nearly two decades, the lesson has been learnt: using an app to make something isn't about the app, it's about making something. Other professional creation creations tools have understood this for years: script writers have Final Draft, programmers have Vim - tools with UIs that are either minimal or hidden completely until the user needs them. </p><p>The recent resurgence away from UI chrome started a few years ago: nearly all web browsers removed the multitude of toolbar buttons they'd been accumulating, leaving just the back, forward and reload buttons. Later, iPad Apps like Flipboard: used intuitive gestures rather to replace explicit on-screen navigation.  But now there's an industry-wide shift towards content, away from 'featured' user interfaces: Google Docs and GMail have also ditched color icons, and Microsoft's Visual Studio has gotten rid of them:</p><figure><img src='/images/blog/cs6.png'><figcaption>Adobe Photoshop CS6 adopts greyscale icons and provides a dark UI.</figcaption></figure><figure><img src='/images/blog/google_docs.png'><figcaption>Google Docs uses shape in place of color.</figcaption></figure><figure><img src='/images/blog/visual_studio_11.jpg'><figcaption>Visual Studio 11 darkens the UI and also uses shapes.</figcaption></figure><p>After using all the UI richness available for such a long time to make beautiful and differentiated products, app designers have realized that the user's work, not their own, is the star of the show. </p><aside class='footnote'><a name='windows_colors'>&dagger; Windows supported more colors than this at the time, but only 20 were guaranteed to remain consistent.</a></aside>",
			"footer":"&mdash; I hope you've enjoyed the article. Let's <a class='intra' href='/contact'>keep in touch</a>."
		}
	]
}
